# SetDisplacedElementIds Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DisplacementElement..::..SetDisplacedElementIds Method
DisplacementElement Class See Also
---
Sets the ids of the elements affected by this DisplacementElement.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public void SetDisplacedElementIds(
	ICollection<ElementId> displacedElemIds
)
```

Visual Basic
---
```text
Public Sub SetDisplacedElementIds ( _
	displacedElemIds As ICollection(Of ElementId) _
)
```

Visual C++
---
```text
public:
void SetDisplacedElementIds(
	ICollection<ElementId^>^ displacedElemIds
)
```

# ### Parameters
displacedElemIds
    Type: System.Collections.Generic..::..ICollection<(Of <(<'ElementId>)>)> Set of ids of elements to be displaced by this DisplacementElement.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | For each individual element in the set displacedElemIds, isAllowedAsDisplacedElement must return true, and the elements must not already be displaced in the specified view. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
DisplacementElement Class
Autodesk.Revit.DB Namespace